# pandas는 series와 dataframe으로 구성
* series는 key와 value 쌍으로 구성된 배열
* dataframe은 table이면서, index를 가진다고 보면 됨

In [3]:
import pandas as pd
pd.__version__

'0.23.0'

##### import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

In [7]:
data['b']

0.5

In [3]:
'a' in data

True

In [8]:
data['k']

KeyError: 'k'

In [9]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

``Series`` 는 dict와 유사한 기능을 가짐

In [ ]:
data['e'] = 1.25
data

### Series는 numpy 배열처럼 기능함
* *slices*, *masking*, *fancy indexing* 이 됨

In [7]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [8]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [10]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [11]:
(data > 0.3) & (data < 0.8)

a    False
b     True
c     True
d    False
dtype: bool

In [12]:
# fancy indexing : list에 있는것들만 끄집어 내라
data[['a', 'e']]

C:\Users\p\Anaconda3\lib\site-packages\pandas\core\series.py:850: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

a    0.25
e     NaN
dtype: float64

In [14]:
data[[0,3]]

a    0.25
d    1.00
dtype: float64

### Indexers: loc, iloc, and ix

In [11]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [12]:
# explicit index when indexing
data[1]

'a'

In [13]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [14]:
data.loc[1]

'a'

In [15]:
data.loc[1:3]

1    a
3    b
dtype: object

The ``iloc`` attribute allows indexing and slicing that always references the implicit Python-style index:

In [16]:
data.iloc[1] # iloc은implicit index

'b'

In [17]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [17]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [18]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [19]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
data[1]

0.5

In [21]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [11]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
data['b']

0.5

In [13]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [24]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [25]:
population['California']

38332521

In [26]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [44]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [106]:
date_time_dict = {'California': '2017-1-1', 'Texas': '2017-1-1', 'New York':'2017-1-1',
             'Florida': '2018-1-1', 'Illinois': '2018-1-1'}
date_time = pd.Series(date_time_dict)
date_time

California    2017-1-1
Texas         2017-1-1
New York      2017-1-1
Florida       2018-1-1
Illinois      2018-1-1
dtype: object

# dataframe

* NaN: Not a Number / NaT: Not a Time
<br>
* dtypes
* shape
* info()
* describe

In [107]:
states = pd.DataFrame({'population': population,
                       'area': area, 'date_time': date_time })
states

            population    area date_time
California    38332521  423967  2017-1-1
Texas         26448193  695662  2017-1-1
New York      19651127  141297  2017-1-1
Florida       19552860  170312  2018-1-1
Illinois      12882135  149995  2018-1-1

In [108]:
states['date_time']=pd.to_datetime(states['date_time'])

In [109]:
states

            population    area  date_time
California    38332521  423967 2017-01-01
Texas         26448193  695662 2017-01-01
New York      19651127  141297 2017-01-01
Florida       19552860  170312 2018-01-01
Illinois      12882135  149995 2018-01-01

In [110]:
states[['population','date_time']]

            population  date_time
California    38332521 2017-01-01
Texas         26448193 2017-01-01
New York      19651127 2017-01-01
Florida       19552860 2018-01-01
Illinois      12882135 2018-01-01

In [111]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [112]:
states.columns

Index(['population', 'area', 'date_time'], dtype='object')

In [113]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [114]:
states['date_time'][2]

Timestamp('2017-01-01 00:00:00')

In [115]:
states['date_time'][0]

Timestamp('2017-01-01 00:00:00')

In [119]:
states['date_time'][2]-states['date_time'][0]

Timedelta('0 days 00:00:00')

In [122]:
states['date_time'][0].year

2017

In [124]:
states['date_time'][0].day

1

In [126]:
states['date_time'][0].month

1

###### Seasonality: 시간, 계절 등에 따라서 일정한 패턴을 보이는 것

In [128]:
states.shape

(5, 3)

In [129]:
states.dtypes

population             int64
area                   int64
date_time     datetime64[ns]
dtype: object

In [165]:
states.describe()   # Date Type이 int 혹은 float인 경우 기초 통계분석을 해준다

         population           area
count  5.000000e+00       5.000000
mean   2.337337e+07  316246.600000
std    9.640386e+06  242437.411951
min    1.288214e+07  141297.000000
25%    1.955286e+07  149995.000000
50%    1.965113e+07  170312.000000
75%    2.644819e+07  423967.000000
max    3.833252e+07  695662.000000

In [132]:
states.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, California to Illinois
Data columns (total 3 columns):
population    5 non-null int64
area          5 non-null int64
date_time     5 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(2)
memory usage: 320.0+ bytes

# single column dataframe

In [135]:
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [136]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [138]:
import numpy as np
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.719900  0.930179
b  0.102159  0.235112
c  0.967516  0.574794

In [140]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [141]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [142]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [143]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [145]:
data.T  # T = data.transpose()  같음

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [146]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [26]:
data.values[0] # 0번째 redord의 값을 구할 수 있다

array([  4.23967000e+05,   3.83325210e+07,   9.04139261e+01])

In [27]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

Thus for array-style indexing, we need another convention.
Here Pandas again uses the ``loc``, ``iloc``, and ``ix`` indexers mentioned earlier.
Using the ``iloc`` indexer, we can index the underlying array as if it is a simple NumPy array (using the implicit Python-style index), but the ``DataFrame`` index and column labels are maintained in the result:

In [147]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

Similarly, using the ``loc`` indexer we can index the underlying data in an array-like style but using the explicit index and column names:

In [148]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

The ``ix`` indexer allows a hybrid of these two approaches:

In [149]:
data.ix[:3, :'pop']

C:\Users\p\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

Keep in mind that for integer indices, the ``ix`` indexer is subject to the same potential sources of confusion as discussed for integer-indexed ``Series`` objects.

Any of the familiar NumPy-style data access patterns can be used within these indexers.
For example, in the ``loc`` indexer we can combine masking and fancy indexing as in the following:

In [150]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

# NumPy 인덱스

In [152]:
data.density > 100

California    False
Texas         False
New York       True
Florida        True
Illinois      False
Name: density, dtype: bool

In [32]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [162]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [163]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

# masking operations

In [164]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121